W7D1/bluebird-07-18-2022-NY-main/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "created_at", "updated_at", "age", "password", "political_affiliation") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        @user = User.new(user_params)

        if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 38], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "  danasdf"], ["updated_at", "2022-08-26 15:56:03.474717"], ["id", 38]]
---
    def update
        @user = User.find(params[:id])

        if @user.update(user_params)